CNXSmartHome/Smart-villa-controller/sdkconfig.defaults
# SVC OS — COMMON build defaults (target-neutral). Applied to EVERY target.
# Per-silicon overrides live in sdkconfig.defaults.<idf_target> and are auto-
# merged by idf.py AFTER this file. Local sdkconfig is git-ignored.

# --- Default target (overridden by `idf.py set-target <t>` e.g. in CI) ---
CONFIG_IDF_TARGET="esp32s3"

# --- Partition table (16 MB dual-OTA; a per-target file may override the name) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- App / OTA rollback ---
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

# --- FreeRTOS / Watchdog ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_INT_WDT=y

# --- Networking / services (optional layer) ---
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Compiler ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
